/*
Од тастатура се внесуваат цели броеви се додека не се внесе нешто што не е цел број.

Да се испечати на екран сумата на броевите во кои цифрите се подредени во опаѓачки редослед. Доколку нема такви броеви, да се испечати порака NEMA.

Објаснување на примерот:

Во првиот пример, нема ниту еден број во кој цифрите се подредени во опаѓачки редослед, па се печати NEMA.

Во вториот пример, во 4321, 21 и 81, цифрите се подредени во опаѓачки редослед, па се печати нивната сума 4423.
  */

#include<stdio.h>
int main(){
int n,broj,c1,c2,suma=0,num1,num2;

while(scanf("%d",&n)){
	broj=n;
	num1=0;
	num2=0;
	while(broj>0){
		c1=broj%10;
		c2=broj/10%10;
		if(c1<c2){
			num1++;
		}
		else{
			num2++;
		}
		broj=broj/10;
	
	}
if(num1>=num2){	
		suma=suma+n;
	}
	
}
if(suma==0){
		printf("NEMA");
    return 0;
	}
printf("%d",suma);
return 0;
}
