/*
Од стандарден влез се вчитува матрица сo n редици и n колони. Прво се вчитува бројот n потоа и елементите на матрицата. Матрицата треба да се трансформира така што секој елемент што се наоѓа десно од споредната дијагонала од истата редица и е помал од просекот на елементите лево од споредната дијагонала од истата редица треба да се замени со -1. Вака трансформираната матрица да се испечати на екран.



Објаснување на примерот:

2 3 5 9

7 8 4 2

4 2 3 5

7 10 9 2

Пример за втората редица, елементот од споредната дијагонала е 4, лево од него се 7 и 8, нивен просек е 7.5 , десно од него е 2, 2 е помал од 7.5 и затоа се заменува со -1.
  */

#include <stdio.h>
#include <math.h>

void Matrix(int a[100][100], int n){
    
    float prosek;
    int brojac=0, zbir=0;
    int i,j;
    for(i=0;i<n;i++){
        brojac=0;
        zbir=0;
        for(j=0;j<n;j++){
            zbir+=a[i][j];
            brojac++;
        }
        prosek=(float)zbir/brojac;
        for(j=i+1;j<n;j++){
            if(a[i][j]<prosek){
                a[i][j]=-1;
            }
        }
    }
}

int main(){
    
    int n;
    int a[100][100];
    scanf("%d", &n);
    
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            scanf("%d", &a[i][j]);
        }
    }
    
    Matrix(a,n);
    
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            printf("%d ", a[i][j]);
        }
        printf("\n");
    }
    
    return 0;
}

