/*
Напишете програма за читање елементи во матрица и проверете дали дадената матрица е симетрична матрица или не. Од стандаред влез се внесуваат димензиите на матрицата M и N соодветно и потоа се внесуваат елементите на матрицата. Ваша задача е доколку матрицата е симетрична да испечатете на екран 1, доколку не е симетрична да испечатете -1, потоа се печати самата матрица на екран.
  */

#include <stdio.h>

int main() {
    
    int  a[100][100];
    int n, m, i, j;
    scanf("%d %d", &n, &m);
    
    for(i=0;i<n;i++){
        for(j=0;j<m;j++){
            scanf("%d", &a[i][j]);
        }
    }
    
    int simetricna=1; 
    for(int i=0;i<n;i++){
        for(int j=0;j<m;j++){
            if(a[i][j]!=a[j][i]){
                simetricna=0;
                break;
            }
        }
    }

    if(simetricna){
        printf("1\n");
    }
    else {
        printf("-1\n");
    }
    
    
    for(int i=0;i<n;i++){
        for(int j=0;j<m;j++){
            printf("%d ", a[i][j]);
        }
        printf("\n");
    }
    
    return 0;
}
