/*
Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви), како и елементите на матрицата со димензии M x N (цели броеви). Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:

Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0
Променетата матрица да се испечати на екран.

Пример.

Влез:
31
4  2  7  11
3  8  16  1
17  8  9  5
6  14  4  7
5  15  5  6

Излез:

-1  -1  -1  -1
-1  -1  -1  -1
1    1   1   1
0    0   0   0 
0    0   0   0 
  */

  
#include <stdio.h>
#include <ctype.h>
#include <string.h>
#define MAX 100

void Matrix(int a[MAX][MAX], int n, int m, int x){
    
    int i,j, zbir_red;
    for(i=0;i<n;i++){
        for(j=0;j<m;j++){
            scanf("%d", &a[i][j]);
        }
    }
    
    for(i=0;i<n;i++){
        zbir_red=0;
        for(j=0;j<m;j++){
            zbir_red+=a[i][j];
        }
        if(zbir_red>x){
            for(j=0;j<m;j++){
                a[i][j]=1;
            }
        }
        else if(zbir_red<x){
            for(j=0;j<m;j++){
                a[i][j]=-1;
            }
        }
        else {
            for(j=0;j<m;j++){
                a[i][j]=0;
            }
        }
    }
    
        for(i=0;i<n;i++){
            for(j=0;j<m;j++){
                printf("%d ", a[i][j]);
            }
            printf("\n");
        }
    }


int main(){
    
    int a[MAX][MAX];
    int n,m,x;
    scanf("%d ", &x);
    scanf("%d %d", &n, &m);
    
    Matrix(a, n, m, x);
    
    return 0;
}
