/*
За еден природен број а велиме дека е порамнување на друг природен број b ако и само ако цифрите еднакви на 9 во бројот b се заменети со цифрата 7 во бројот а.

Пример. Бројот 734775 е порамнување на бројот 934795.

Од стандарден влез се внесуваат непознат број на цели броеви (не повеќе од 100), се додека не се внесе нешто што не може да се интерпретира како цел број.

Ваша задача е да ги отпечатите најмалите 5 од порамнувањата на сите внесени броеви, по редослед од најмалиот кон најголемиот.

Забелешка: Доколку се внесат помалку од 5 броеви, тогаш печатите толку броеви колку што се соодветно внесени.

Наоѓањето на порамнувањето на даден број треба да се реализира во посебна рекурзивна функција poramnet(int a).

Пример.

За броевите: 9592, 69403, 100007, 6, 987, 6977, 33439,

треба да се најдат нивните порамнувања ( тоа се: 7572, 67403, 100007, 6, 787, 6777 и 33437, соодветно),

и да се отпечатат најмалите 5 од нив по овој редослед: 6 787 6777 7572 33437.

ЗАБРАНЕТО е користење на глобални променливи.
  */


#include <stdio.h>
#include <ctype.h>
#include <string.h>
#define MAX 100

void sort(int *a, int n){
    
    int temp;
    for(int i=0;i<n;i++){
        for(int j=i+1;j<n;j++){
            if(a[i]>a[j]){
                temp=a[i];
                a[i]=a[j];
                a[j]=temp;
            }
        }
    }
    
}

int poramnet(int n){
    
    if(n==0){
        return 0;
    }
    
    int cifra=n%10;
    
    if(cifra==9){
        return 7+10 * poramnet(n/10);
    }
    
    return cifra+10 * poramnet(n/10);
    
}

int main(){
    
    int n=0,i=0;
    int a[100];
    while(scanf("%d", &a[i])==1){
        i++;
        
    }
    n=i;
    
        for(i=0;i<n;i++){
            a[i]=poramnet(a[i]); //poramnet(n)
        }
    
    sort(a, n);
    
    if(n<5){
        
        for(i=0;i<n;i++){
            printf("%d ", a[i]);
        }
    }
    else {
        
        for(i=0;i<5;i++){
            printf("%d ", a[i]);
        }
        
    }
    
    return 0;
}

