/*
Да се напише рекурзивна функција за наоѓање на максималната цифра од даден цел број.

Од стандарден влез се внесуваат непознат број цели броеви се додека не се внесе нешто што не е број. За секој од нив да се испечати максималната цифра во посебен ред.

Забелешка: Решението со рекурзивна функција носи 100% од поените, а со нерекурзивна функција 70% од поените.

Забелешка: ЗАБРАНЕТО е користење на глобални променливи
  */

#include <stdio.h>
#include <ctype.h>
#include <string.h>

int max_cifra(int n){
    
    if(n==0){
        return 0;
    }
    
    int cifra=n%10;
    
    int max=max_cifra(n/10);
    
    if(cifra>max){
        return cifra;
    }
    else {
        return max;
    }
    
}

int main(){
    
    int n;
    
    while(scanf("%d", &n)){
        printf("%d\n", max_cifra(n));
    }
    
    return 0;
}


