/*
  За квадратна матрица А со димензии n x n, од стандарден влез се внесува бројот n (n > 2) и елементите на матрицата (реални броеви). Нека X e збирот од елементите под главната дијагонала во матрицата А. Нека Y е збирот од елементите под споредната дијагонала во матрицата А. Да се креира нова матрица B на следниот начин:

сите елементи од главната дијагонала во матрицата B треба да имаат вредност X

сите елементи од споредната дијагонала во матрицата B треба да имаат вредност Y

ако даден елемент припаѓа и на главната и на споредната дијагонала во матрицата B, тогаш неговата вредност e X+Y

сите останати елементи во матрицата B имаат вредност 0

Новата матрица B да се испечати на стандарден излез.

Матрица А
5  5.5  6  1.2  2.5
8  95.1  21.3  13  0.2
34  4.1  37.4  22  6
4.1  5.5  0.7  7  0
42  1.1  3.2  7.5  1.8

Матрица Б
110.2  0  0  0  49.5
0  110.2  0  49.5  0
0  0  159.7  0  0
0  49.5  0  110.2  0
49.5  0  0  0  110.2


*/

#include <stdio.h>
#include <ctype.h>
#include <string.h>
#define MAX 100

void matrix_B(double a[MAX][MAX], double b[MAX][MAX], int n){
    
    double X=0, Y=0;
    
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            scanf("%lf", &a[i][j]);
        }
    }
    
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            if(i>j){
                X+=a[i][j];
            }
            if(i+j>n-1){
                Y+=a[i][j];
            }
        }
    }
    
    // for(int i=0;i<n;i++){
    //     for(int j=0;j<n;j++){
    //         b[i][j]=0;
    //     }
    // }
    
    for(int i=0;i<n;i++){
            b[i][i]=X;
            b[i][n-i-1]=Y;
            if(i==n-i-1){
                b[i][i]=X+Y;
        }
    }
    
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            printf("%.1lf ", b[i][j]);
        }
        printf("\n");
    }
    
}


int main(){
    
    double a[MAX][MAX], b[MAX][MAX];
    int n;
    scanf("%d", &n);
    
    matrix_B(a, b, n);
    
    return 0;
}
