/*
Полу-елка се црта со ѕвездички (*) и прачки (|) на следниот начин:

*
|
|**
|
|***
|
|****

Значи, во првиот ред има ѕвездичка. Во следниот ред има прачка. Понатаму преку еден ред имаме или само прачка или прачка со неколку ѕвездички (една повеќе отколку во прет-претходниот ред). Полу-елката завршува со ред во кој има една прачка и N ѕвездички.

За дадено N, отпечатете ја полу-елката според описот.

За N=4, треба на излез да се добие како примерот погоре.
  */

#include <stdio.h>

int main() {
    
    int i,j,n;
    scanf("%d", &n);
    printf("*");
    for(i=1;i<=n;i++){
        if(i!=1){
            printf("|\n|");
            for(j=1;j<=i;j++){
                printf("*");
            }
            
        }
        printf("\n");
    }
    
    
    return 0;
}
